airpocket-soundman/IchiPing/firmware/projects/10_inference/frdmmcxn947_cm33_core0/pins/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);
void SAI1_InitPins(void);
void LPSPI1_InitPins(void);
void ILI9341_GPIO_InitPins(void);
void SW3_InitPins(void);

#if defined(__cplusplus)
}
#endif
#endif
